let data = [
    {
        name: "Лісовик",
        img: "../assets/images/photo_2023-12-26_14-42-00.jpg",
        text: `<p>   Лісовик (також відомий як лісний дух, лісовий дух або лісний гоблін) - це істота з фольклору та міфології, пов'язана з лісом. Цей персонаж має різні вигляди в різних культурах і легендах.
        </p>
        <br>
        <p>    У деяких варіантах, лісовик може бути зображений як маленька істота з людською або подібною до людини формою. Він може мати зелену або коричневу шкіру, волосся чи бороду з листям або мохом, що допомагає йому злитися з лісовим середовищем. Його очі можуть бути яскраві та загадкові, а вуха - великі і сплющені, схожі на вуха тварини.

        Він може носити одяг у вигляді листя, кори, гілок або натуральних матеріалів, що допомагає йому приховатися серед дерев та рослин. Він часто володіє волшебними здібностями, пов'язаними з природою, і вважається покровителем лісу та його мешканців.
         </p>
        `,
    },
    {
        name: "Вовкулака",
        img: "../assets/images/photo_2023-12-26_15-19-07.jpg",
        text: `<p> Вовкулака - це міфічне створіння, яке зустрічається в українському фольклорі. Вовкулака також відома як "вовчий чоловік" або "оборотень". Згідно з українськими легендами, вовкулака має здатність перетворюватися на вовка або оборотня.

        Опис вовкулаки в українському фольклорі може варіюватися. Іноді вовкулаку зображають як великого, жахливого вовка з людськими рисами, здатним говорити. Інші версії описують вовкулаку як оборотня, який здатний перетворюватися на вовка чи людину.
        
        Українські легенди пов'язують вовкулаку з різними негативними атрибутами, такими як хижість, кровожадність та зв'язок зі смертю. Віриться, що вовкулаки полюють на людей та худобу, а їх смертоносні здібності проявляються особливо сильно під час повного місяця.
        З'являються такі істоти в тому випадку якщо вагітна жінка неочікувано бачить вовка або з'їдає його жертву. оли він з'являється у своїй людській формі, має зловісний вигляд з великими бровами, що зростають на переніссі, та червоними очима, що служать його впізнавальною рисою.</p><br>

        
        <p>Важливо зазначити, що вовкулака - це істота з української міфології та фольклору, і не існують докази його реального існування. Вовкулака є популярним персонажем української культури, який часто зустрічається в українських казках, легендах та народних оповіданнях.</p> `,
    },
    {
        name: "Чугайстер",
        img: "../assets/images/photo_2023-12-26_16-24-53.jpg",
        text: `<p> Пов'язані з Чугайстером існують різні історії та легенди. Ось кілька прикладів:
        <br><br>
        1. За однією з версій, Чугайстер колись був звичайним чоловіком, який випадково потрапив під прокляття злих відьом. Прокляття перетворило його на страхітливу істоту, змушуючи блукати лісом у пошуках жертв. Люди, які зустрічають Чугайстера, повинні уникати його, або ж виявити доброту і милосердя, щоб змінити його прокляття.
        <br>     
        2. Існує також версія, що Чугайстер є оборотнем або перевертнем, здатним змінювати свою форму або вигляд. Він може приймати різні образи, щоб збентежити та заплутати тих, хто потрапляє в його лісовий уклад.
        <br>  
        3. За деякими легендами, Чугайстер володіє магічними здібностями та знаннями про таємниці лісу. Він може бути порадником і помічником тим, хто проявляє повагу до природи і має добрі наміри. В таких історіях Чугайстер може виконувати добрі вчинки і допомагати людям, які потрапляють у складні ситуації.
        <br>
        Це лише кілька варіантів історій, пов'язаних з Чугайстером. В різних регіонах та культурах можуть існувати різні інтерпретації цього персонажа.</p><br>

        
        <p> </p>`,
    },
    {
        name: "Мавка",
        img: "../assets/images/mavkaLisova.jpg",
        text: `<p>Мавка - це персонаж української фольклорної традиції, який часто зустрічається в українських казках, легендах та народних піснях. Мавка зазвичай зображується як молода дівчина з довгими волоссям та вбрана у весняні квіткові сукні.

        У фольклорі Мавка часто асоціюється з лісом та природою. Вона вважається покровителькою лісу, рослин, тварин і всього живого. Мавка володіє магічними здібностями та може змінювати свій зовнішній вигляд, зникаючи серед дерев або перетворюючись на тварину.
        
        У казках Мавка часто зустрічається як загадкова та приваблива дівчина, яка привертає увагу чоловіків. Вона може допомагати або завдає шкоди людям, залежно від їхньої поведінки та ставлення до природи. Мавка також відома своєю здатністю заворожувати своїм співом та танцями.
        
        <br>Мавка є символом природи, її краси та сили, а також нагадує людям про важливість бережного ставлення до навколишнього середовища. <br> <br>
        Мавка пов'язана зі сезонами та циклічністю життя. Вона виступає як захисниця дикої природи та її ресурсів. Часто її зображують у зв'язку з рослинністю, водними джерелами та тваринами лісу.

        У фольклорних оповіданнях Мавка може мати різні риси характеру. Вона може бути доброю та милосердною до людей, але також може виявляти свою сильну та непередбачувану сторону. Легенди про Мавку часто пов'язані з магією, коханням та світовим порядком.

        Мавка стала невід'ємною частиною української культури, мистецтва та літератури. Вона з'являється у багатьох відомих творах, таких як поема Лесі Українки "Мавка", опери Миколи Лисенка "Тарас Бульба" та багатьох інших. Образ Мавки надихав художників, письменників та поетів протягом багатьох століть і продовжує жити в українській культурі.

        <br><br> Мавка не залишає тіні, а коли вона біжить, трава не перегинається. Одна зі страшних рис мавок в деяких джерелах полягає у тому, що ззаду видно, що вони не мають спини й прозираються їхні нутрощі. Вони часто допомагають людям у догляді за худобою, захищаючи її від звірів, вони також вміють засівати рослини.</p> `,
    },
    {
        name: "Стратим-птиця",
        img: "../assets/images/image_2023-12-26_17-12-58.png",
        text: `<p> Стратим-птиця — усім птицям мати. Живе Стратим-птиця на океані-морі. І дітей робить на океані-морі.
        <br><br>
         Тримає увесь білий світ під правим крилом. Топить вона кораблі з товарами дорогоцінними. Коли Стратим стрепенеться о другій годині після півночі, заспівують усі півні та на усій землі. Тому Стратим-птиця усім птахам мати.
        Мабуть, про цього ж велетенського птаха, якого іноді називали Страфілом, оповідає давній рукопис: «Єсть курей, що головою досягає до небес, а море йому до коліна; коли сонце омивається в океані, тоді океан всколєбається, і почнуть хвилі бити кура по пір’ю; він же, відчувши хвилі, кричить “коко-реку”, що означає: “Господи, Явь світу світло!”».
        Втім, вчені вважають, що Стратим не надпівень, а страус: колись дуже давно перекладачі зіткнулися з цим словом в грецькому тексті і, не знаючи такого птаха, просто переписали найменування слов’янськими буквами. Ось і вийшло «Стратим». Зображували птаха-гіганта з маленькою головою на тонкій шийці, гачкуватим дзьобом, довгим вузьким тілом і одним піднятим вгору крилом. 
        Стратим — була світлим птахом бога вітрів, Стрибога, вона управляє усіма вітрами.</p>`,
    },
    {
        name: "Алконост",
        img: "../assets/images/alkonost.jpg",
        text: `<p>Алконост — дивовижна птиця, мешканка Вирію — слов’янського раю.
        <br><br>
        Лице у неї жіноче, голова увінчана короною й "ореолом, на якому іноді поміщено короткий напис", тіло ж пташине.
        В руках тримає райські квіти або розгорнутий сувій з пояснювальним написом.
        У деяких описах згадується "річка Евфраній" як місце проживання. Голос в Алконоста солодкий, як сама любов. Хто почує спів Алконоста, від захвату може забути усе на світі, але зла від неї немає, на відміну від Сиріна. Алконост несе яйця «на краю моря», але не висиджує їх, а занурює в морську глибину. У цю пору сім днів стоїть безвітряна погода.Має дівочу голову, . </p>`,
    },
    {
        name: "Болотник та Болотниця",
        img: "../assets/images/bolotnyk.png",
        text: `<p>Болотник (Болотник, Болотняник, Багник) — злий дух на болоті, який намагається затягнути людину в трясовину; рід лісовика або водяного, який живе у болоті. У Новгородській Кормчій ХІІІ ст. відмічено, що язичники «жроуть (приносять жертви) бісом, і болотом, і колодязем». Дух болота, живе у великому кам’яному будинку з дружиною і дітьми. Дружина його — Болотниця, діва, яка потонула в болоті. Він родич водяного і лісовика. Болотняник — сивий старий з широким жовтуватим обличчям.
        Обернувшись ченцем, обходить і заводить подорожнього, заманює його в трясовину. Любить гуляти по берегу, лякати тих, хто йде через болото, різкими звуками, зітханнями; видуваючи повітря водяними пухирями, голосно прицмокує.
        Болотняник вправно влаштовує пастки для нетямущих: кине клапоть зеленої трави або корч, або колоду — так і вабить ступити, а під ним — трясовина, глибока драговина! Ну а ночами випускає він душі дітей, які потонули нехрещеними, і тоді на болоті перебігають-перемигуються блудні сині вогники.
        <br><br>
        Болотниця, також відома як омутниця або лопатниця, є персонажем української міфології. Вона є водяною пані, яка живе в болотах та трясовинах. Болотницю описують як дівчину з білою шкірою та чорним волоссям. У неї гусячі ноги з перетинками, а очі горять, як у кішки.

За повір'ями, болотниця з'являється в ясну літню ніч, коли піднімається з трясовини та сідає серед трав і квітів, ховаючи свої гусячі ноги. Вона кличе людину ніжним голосом та благає вивести її з болота. Але якщо людина підійде ближче, болотниця миттєво затягне її до себе у трясовину. Крім того, болотниця може насилати на поля нищівні бурі, зливи та град.

Варто зазначити, що образ болотниці не зафіксований у слов'янських фольклорних джерелах, тому немає підстав вважати її справжньою частиною народних вірувань. Проте, болотниця існує в казках інших народів, наприклад, в Данії </p>`,
    },
    {
        name: "Потерчата",
        img: "../assets/images/poterchata.jpg",
        text: `<p>Потерча (також відомий як потерчук або страдча) - це істота з української міфології, яка представляє собою дитину, що померла, не бувши хрещеною. Існування таких демонічних істот стало відомим після хрещення Русі. Важливо зауважити, що давня традиція надавати імена таким неспокійним душам, які турбують живих, має коріння у міфології про створення світу. Згідно з цим міфом, кожне створіння у всесвіті отримувало своє ім'я, і саме через це набувало існування. Таким чином, дати ім'я означало надати життя.

        Тепер давайте перейдемо до цікавих фактів про потерчат. Як вже згадувалося, вони є мертвими дітьми, часто тими, хто помер до семи років і не був хрещеним. Така дитина не могла піднятися до небес. Якщо протягом семи років після смерті такому немовляті ніхто не надасть імені (через обряд, що був описаний раніше), його душа потрапляє під владу нечистої сили. Однак, якщо "хрещення" відбудеться, дитина стає ангелом.
        
        Часто таких малюків крадуть русалки, і вони самі стають русалками-семилітками. Вони мають особливу здатність добре загадувати та розгадувати загадки.
        
        <br><br>Злі духи терзають викрадених немовлят, і лише під час Зелених свят вони вільні від страждань. Так, у Лубенському повіті на Полтавщині жінки, які поховали нехрещених малюків, колись збирали всіх дітей з вулиці на Русалчин Великдень (четвер під час Троїцького тижня) і пригощали їх. На Поділлі, під час архаїчного обряду «гоніння шуляка», жінки вшановували своїх померлих, зокрема нехрещених, дітей. За віруванням, під час Зелених свят вони з'являлися у вигляді "мавок", "нявок", "гречух" і лякали всіх своєю непередбачуваною поведінкою.</p>`,
    },
    {
        name: "Гамаюн",
        img: "../assets/images/gamayun.png",
        text: `<p>Гамаюн — віщий птах, посланець богів, їх глашатай, який співає людям божественні гімни і провіщає майбутнє тим, хто уміє чути таємне.

        У старовинній «Книзі, глаголемой Козмографія» на карті зображена кругла рівнина землі, омивана з усіх боків річкою-океаном. На східній стороні зазначений «острів Макарійський, перший під самим сходом сонця, біля блаженного раю; тому його так нарікають, що залітають в цей острів птахи райські Гамаюн і Фенікс і пахощі заносять дивні». Коли летить Гамаюн, зі сходу сонячного виходить смертоносна буря.
        
        Гамаюн усе на світі знає: про походження землі і неба, богів і героїв, людей і чудовиськ, птахів і звірів.

        Історія образу Гамаюна має свої корені в іранському фольклорі, де птах з назвою "хума(й)" вважався міфічною птахою щастя, яка приносила владу тим, над ким вона пролітає низько, повіваючи крилами над їхньою головою. Українське слово "Гамаюн" є іскаженням цього іранського слова.</p>`,
    },
    {
        name: "Сиріна",
        img: "../assets/images/serina.jpg",
        text: `<p>Сирін  — один з райських птахів, навіть сама назва співзвучна з назвою раю: Вирій. Проте це зовсім не світлі Алконост і Гамаюн. Сирін — темна птиця, темна сила.
Від голови до пояса Сирін — жінка незрівнянної краси, від пояса — птиця. Сирін прилітає лише до щасливих людей. Хто послухає її голос, забуває про все на світі і скоро прирікається на біди і нещастя, а то й помирає, причому не має сил, щоб змусити себе не слухати голосу Сирін. А голос цей — істинне блаженство!Голос Сирина настільки прекрасний, що навіть боги, почувши його, можуть відволіктися на щось інше. За легендою, саме через співи Сирина пропав молодий Купала.
Сирін - одна з небагатьох істот, здатних вільно переміщатися між дійсністю, Нав'ю і Прав'ю
Спів Сирін приносить людям забуття і втрату пам’яті. Самі птахи не злобливі, але дуже байдужі. Втілюють печаль.</p>`,
    },
    {
        name: "Полудниця",
        img: "../assets/images/Полудниця.jpg",
        text: `<p>Полудниця - це персонаж зі слов'янської міфології, який є жіночим духом та з'являється саме в полудень, щоб покарати тих, хто працює в цей час. Вона представляє собою уособлення сонячного удару.
        <br>
        У різних версіях міфології полудниця може мати різні атрибути та характеристики. Зазвичай вона зображується як приваблива жінка з довгими волоссям та блідою шкірою, але іноді може набувати інших форм. Її очі можуть бути червоними або іскристими, а вона може мати крила або хвіст. Іноді полудницю зображають як злу і небезпечну істоту, яка може причиняти хвороби або смерть, особливо людям, які її зустріли.

Зустріч з полудницею часто вважається небезпечною. Вона може викликати головний біль, заплутати подорожніх у лісі або навіть покарати їх за небажання відповідати на її запитання або виконувати її прохання. Щоб уникнути зустрічі з полудницею, люди можуть носити захисні символи, такі як розплутаний ланцюжок або гілку від ялини.
</p>`,
    },
    {
        name: "Банник",
        img: "../assets/images/bannyk.png",
        text: `<p>Банник - демонологічний персонаж у віруваннях східних слов'ян, особливий вид домовика, нечиста сила.
        Дух — мешканець лазні, злий, з'являється у обліку маленького голого чоловічка із веселковими очима. Живе за кам'янкою або під полком. Буває невидимий (за деякими повір'ями, має шапку-невидимку) або показується у вигляді людини з довгим волоссям, голого діда, покритого брудом і листям від віників, собаки, кішки, білого зайця та ін. Існує повір'я, що банник перший раз з'являється в лазні після того, як там побуває породілля. У нетопленій лазні живе завжди, пара виганяє його ненадовго. Вважається, що він миється в лазні, тому для нього слід залишати воду, мило і віник, інакше він бризкає окропом, кидає розжарені камені, напускає чаду. Заходячи в лазню, прийнято було говорити: «Хрещений на полок, нехрещений з полку» (Смоленська губ.).

Банник шкодить тим, хто приходить до лазні пізно, після заходу сонця, вночі, або після двох-трьох змін парильників. Спочатку присипляє, потім довгими та товстими губами обволікає рот та заганяє у грудну клітку гаряче повітря. Банник душить або здирає шкіру. Особливо не полюбляє випивак. Вмілі люди виганяють його лазневим віником. Банник лякає, заходить у лазню, прикидаючись людиною. Банник може підмінити залишену дитину. Одмінки бувають потворними: великоголовими, пузатими, не ростуть, не ходять, не кажуть, живуть кілька років, а потім помирають або перетворюються на головешку, на лазневий віник. Банник іноді захищає від інших демонічних істот (овинника, мерців та ін).

З інших функцій банника слід зазначити його участь у святкових ворожіннях: опівночі дівчата підходять зовні до дверей лазні, задерши спідниці; або підходять до чолу кам'янки, або сунуть руку в димник: якщо банник доторкнеться волохатою рукою — буде багатий наречений, якщо голою рукою — бідний. Тим, хто, гадаючи, суне руку у вікно лазні, банник може скувати пальці залізними кільцями. Для того щоб захищатися від шкідливих дій банника, задобрити його, приносять до нової лазні хліб і сіль, ховають під порогом задушеного чорного півня або курку.
        </p>`,
    },
    {
        name: "Шутовка",
        img: "../assets/images/shutovka.jpg",
        text: `<p>Шутовка — водяна діва в міфології півночі.
        Ця назва для русалок вживана в уральських козаків, у Володимирській губернії і в інших місцях. Шутовка означає власне дружина або донька блазня, а блазнем називають евфемістично біса. Таким чином, назви шутовка і чортиця цілком однозначні.
        За народними віруваннями (у Володимирській губернії), різні лісовики, водяні і русалки-шутовки є не хто інші, як звичайні «бувалі» (тобто давні) люди, на яких нібито тяжіє батьківське прокляття. Це ті самі люди, які померли і прокляті своїми батьками, і зокрема своїми «недобрими матерями».
        Замогильне життя цих «проклятих людей» приречене на перебування тут на землі, в межах вод: озер, боліт і лісової гущавини. Уся різниця між ними і звичайними смертними полягає нібито в тому, що вони позбавлені вільного спілкування із звичайними людьми.
        Спосіб життя цих приречених на вигнання бувалих людей цілком ясно в народі не зображений; відомо лише, що усі вони є ворогами звичайних смертних і всіляко намагаються заманити необережних у свій напівпекельний світ.
        Всяка водяниця колись була дівчиною, але або сама потонула, ненавмисно, або була занапащена чиєюсь злою волею. Ті, які були хрещені і називаються шутовками, можуть через два або три роки вернутися до людей, особливо якщо не потонули, а були прокляті батьками і понесені на річкове дно нечистою силою. Ці називаються «прокляті», або «шутовки».
        Вони вернуться додому, якщо хрещена людина надіне їм хрест на шию. Шутовки також виходять заміж за вподобаних їм смертних, які зуміють відчитати їх від закляття.
        </p>`,
    },
    {
        name: "Водяник",
        img: "../assets/images/vodyanyk.jpg",
        text: `<p>Водяник - це персонаж в українській народній міфології, який населяє водні простори, такі як річки, озера та ставки. Він зазвичай зображується як старий чоловік з бородою, але також може приймати форму молодого чоловіка з волоссям, що нагадує водорості. Водяники володіють великою силою й владою над водою, і вони можуть викликати шторми, затоплення та інші водні лиха. Вони також володіють здатністю змінювати свій зовнішній вигляд, щоб привернути увагу людей та заманити їх до води. Водяники можуть бути як добрими, так і злісними, іноді вони допомагають людям, а іноді шкодять їм.В образі водяника поєднуються як антропоморфні, так і зооморфні риси. Він нагадує діда з довгою бородою, але також має хвіст. Важливою ознакою, що свідчить про його пов'язаність із "нечистими силами", є здатність водяника перетворюватися на різні істоти, такі як чоловік, дитина, козел, собака, кіт, риба і т.д.

        Водяника сприймали як володаря ставків і водоймищ, який "править" над русалками і дбає про рибу. Віриться, що він живе у вирах річок, біля млинів. Його зловісні дії щодо людей полягали в тому, що, розгнівавшись, він міг руйнувати греблі і млини.
        <br> Рибалки та мірошники принесли водянику в жертву хліб, сіль, рибу та інші предмети, щоб заспокоїти його. Водяник не терпить п'яниць і може наказати їх за це.</p>`,
    },
    {
        name: "Караконджо",
        img: "../assets/images/karakonjo.png",
        text: `<p>Караконджо — у південнослов’янській міфології це водяні демони, які виходять в розпал зими з води на сушу після опівночі. Вони приймають найрізноманітніший вигляд: коня з людською головою і крилами, голих людей, обліплених колючками, червоних або чорних бісенят, потворних карликів. Напавши на запізнілого подорожнього, Караконджо їздять на ньому верхи до самого світанку. Втім, від демона легко уберегтися: досить вийняти з торбинки хліб, сіль, будь-який залізний предмет, показати чудовиську — а того вже і слід пропав.
        </p>`,
    },
    {
        name: "Відьма",
        img: "../assets/images/vidma.png",
        text: `<p>Відьма — один із основних персонажів демонології східних і західних слов’ян, який поєднує риси реальної жінки і демона. За народними уявленнями, звичайна жінка ставала відьмою, якщо в неї вселявся (за її бажанням або проти волі) злий дух, диявол, душа померлого; якщо вона жила разом з бісом, змієм або укладала з ними угоду заради збагачення. Магічна сила могла дістатися у спадок від матері-відьми або бути придбаною, наприклад, від вмираючої Відьми, яка передала спадкоємиці свої чаклунські знання («свого духу»). Вважалося також, що здатність жінки до відьмацтва могла бути викликана неправильною поведінкою її батьків: наприклад, якщо мати годувала її грудьми «три Великі п’ятниці», тобто більше двох років; якщо її мати і вона сама були народжені поза шлюбом.
        <br>Співіснування у Відьмі людського і демонічного начал могло розумітися як наявність у неї двох душ: звичайної, людської, і злої, демонічної, яка покидає ночами тіло сплячої жінки і шкодить людям.
        Зовнішньому вигляду Відьми характерні, за народними уявленнями, деякі демонічні риси або особливі прикмети: наявність хвостика, ріжок, крил. Відьма видає себе незвичайним поглядом: у неї запалені, почервонілі очі або дикий, похмурий погляд; її вирізняє звичка не дивитися прямо в очі, в зіницях Відьми можна побачити перевернуте відображення людини. Зазвичай відьму уявляли собі старою і потворною, із сивим розпатланим волоссям, гачкуватим носом, кістлявими руками, іноді з тілесними недоліками (горбатість, кульгавість). Відьмою часто вважали жінку, яка живе самотньо, непривітну, дивну.
        <br>Особливо небезпечними ставали Відьми у великі свята року, в періоди повного місяця або молодика, в грозові ночі. У східних слов’ян часом їх активності вважалися: ніч на Івана Купала, Юріїв день, Благовіщення, Великдень, Трійця, Різдво, а у західних слов’ян — дні св. Яна, Люції, Петра і Павла, Зелені святки, свято Божого Тіла, а також переддень 1 травня (Вальпургієва ніч). Нападаючи в такі дні на людей, лякаючи і переслідуючи їх, Відьма оберталися жабою, кішкою, собакою, свинею, коровою та іншими тваринами; птахом (сорокою, вороною, совою, куркою, качкою); комахами (мухою, метеликом, павуком); могли набирати вигляду предметів (колеса, решета, стогу сіна, клубка ниток, палиці, гілки, кошика) або ставати невидимими.
Головною шкідливою властивістю Відьми вважалася здатність псувати худобу і відбирати у корів молоко. З цією метою Відьма збирала росу на межах і пасовищах, волочучи по траві полотно (фартух, хустку, сорочку, циділку, віжки), потім вичавлювала тканину і поїла водою свою корову або просто вішала намоклу тканину у будинку, і з неї рясно текло молоко. Широко відомі билички, в яких чоловік несвідомо повторює чаклунські дії Відьми, яка відбирає молоко, а потім не може позбавитися великої кількості молока у себе вдома.
<br>Відьмі приписували здатність насилати порчу на людей, домашніх тварин, рослини, продукти і тому подібне, внаслідок чого люди і тварини хворіють, гинуть, новонароджені не сплять ночами, плачуть, домочадці сваряться, весілля невеселі, продукти псуються, нитки рвуться, робота не вдається. В Україні і Карпатах вірували, що Відьми можуть наслати град, ураганні вітри, повені, пожежі, викрасти небесні світила, викликати посуху та інші лиха.
<br>Для захисту від Відьом використовували обереги. Щоб не дати Відьмі проникнути в двір і будинок, на воротах закріплювали свічку, освячену на Стрітення, або мітлу на довгій палиці; у стовпи воріт встромляли зуби борони, колючі рослини, затикали в дверні щілини кропиву або гілку осики, берези, клена; біля дверей хліва ставили борону зубами вперед або вила, рогач; на поріг клали ніж, сокиру, косу та інші різальні предмети, що колють. Виконували магічні дії, які символізують зведення перешкоди: обсипали будинок і хлів маком, обводили косий по землі круг, обкреслювали крейдою стіни, малювали на дверях хрести і тому подібне.
<br>Засоби розпізнавання Відьми складають одну із найбільш характерних особливостей усього круга повір’їв про Відьом. Оскільки реальна жінка, яка живе серед людей, змінивши свій вигляд, завдавала шкоди односельцям, то головною метою звичаїв і ритуалів, приурочених до небезпечних днів календаря, було прагнення розпізнати її, вислідити, викрити і знешкодити. Вважалося, наприклад, що купальське вогнище притягує до себе Відьму, викликаючи у неї фізичні страждання, і що вона вимушена прийти до вогнища, щоб припинити свої муки. Існували також спеціальні прийоми, покликані притягнути Відьом до купальського вогнища: кип’ятили циділку з увіткненими в неї голками або осиковими кілочками, лили молоко зіпсованої відьмою корови у вогонь або на розжарений серп. Намагалися також підстерегти Відьму у хліву, куди вона намагалася проникнути у вигляді жаби або якої-небудь тварини. Виявивши біля корови жабу, хазяї пробивали їй лапу або око, і наступного дня виявлялося, що одна із сусідок ходить з перев’язаною рукою, шкутильгає або скривіла — її і вважали Відьмою. Іноді спійману у хліву тварину вбивали або кидали у воду, вважаючи, що від цього Відьма повинна померти або втопитися. Відьму можна було пізнати під час церковної служби (особливо пасхальної: вона намагається доторкнутися до ікони, хоругви, ряси священика, не хоче йти з хресним ходом, тримає на голові дійницю, стоїть спиною до вівтаря і тому подібне. На Україні говорять, що варто тільки, проходячи повз групи жінок, скласти пальцями правої руки «дулю» і засунути її під пахву лівої руки, як Відьма тут же почне сваритися і лаяти того, хто проходить.
    <br>Вважалося також, що Відьма не тоне у воді: під час посухи жінок заганяли у воду у пошуках Відьми.
Один із стрижневих мотивів биличок про Відьом — польоти Відьом на шабаш. За західнослов’янськими повір’ями, напередодні Вальпургієвої ночі Відьма маститься жиром крота і вилітає через димар із словами: «Виїжджаю, виїжджаю, ні за що не зачіпаю». Вона летить на «гору відьми» верхи на мітлі, лопаті, коцюбі, косі, вилах, в ступі, на плугу, палиці, кінському черепі, на сороці або на тваринах. На шабаші Відьми, які злетілися, танцюють разом із бісами, вклоняються козлові, бенкетують, затівають підступи проти людей. У східнослов’янських биличках детальніше описуються епізоди нічних чаклунських дій Відьми перед польотом, за якими потайно спостерігає очевидець. Місцем зборищ усіх Відьом виявляються перехрестя доріг, межі, гори, але найчастіше — дерева (дуб, груша, сосна, тополя, береза), де вони веселяться, бенкетують, танцюють, б’ються між собою, збивають масло і тому подібне. Виявивши людину, яка йде за нею, Відьма відправляє її назад, нагородивши дивовижним конем, який насправді виявляється помелом, палицею, кривою березою.
Вважалося також, що Відьма не тоне у воді: під час посухи жінок заганяли у воду у пошуках Відьми.
<br>Один із стрижневих мотивів биличок про Відьом — польоти Відьом на шабаш. За західнослов’янськими повір’ями, напередодні Вальпургієвої ночі Відьма маститься жиром крота і вилітає через димар із словами: «Виїжджаю, виїжджаю, ні за що не зачіпаю». Вона летить на «гору відьми» верхи на мітлі, лопаті, коцюбі, косі, вилах, в ступі, на плугу, палиці, кінському черепі, на сороці або на тваринах. На шабаші Відьми, які злетілися, танцюють разом із бісами, вклоняються козлові, бенкетують, затівають підступи проти людей. У східнослов’янських биличках детальніше описуються епізоди нічних чаклунських дій Відьми перед польотом, за якими потайно спостерігає очевидець. Місцем зборищ усіх Відьом виявляються перехрестя доріг, межі, гори, але найчастіше — дерева (дуб, груша, сосна, тополя, береза), де вони веселяться, бенкетують, танцюють, б’ються між собою, збивають масло і тому подібне. Виявивши людину, яка йде за нею, Відьма відправляє її назад, нагородивши дивовижним конем, який насправді виявляється помелом, палицею, кривою березою.</p>`,
    },
    {
        name: "Чорт",
        img: "../assets/images/chort.png",
        text: `<p>Чорт — найпопулярніший персонаж української демонології. Відомий ще за назвами сатана, біда, мара, дідько, злий, лихий, рогатий, куций, лукавий, нечистий, щезник. Як узагальнене поняття "нечистої сили" чорт може заміщати майже кожну демонічну істоту, яка шкодить людині. Безпосередньо співвідносні з ним поняття ляку, блуду, вихору. Для прикладу, персоніфікований ляк називають лякачем, племетою, маняком, проте можуть просто сказати, що лякав нечистий, чорт. Коли людину хапає блуд, то кажуть, що то її "чорт водить". Коли крутить вихором, то це "чорт жениться", "чорти молоду несуть". 
        <br>
        Улюблені місця чорта — перехрестя, цвинтарі, закинуті церкви чи хати-пустки, смітники ("сутичі"), корчі бузини, будяки. Найчастіше він виявляє себе ополудні й опівночі, до півнів. Зазвичай чорта уявляють схожим на людину, проте оброслу чорною шерстю, з рильцем, хвостом, рогами, вивернутими колінами, копитами чи "курячими" або "бузьковими" лапами, кігтями. Очі та язик чорта "пекельного" кольору. Він накульгує на одну ногу, тому що не має п’яти. Хвоста чорт нерідко ховає під фалдами, а ріжки — під циліндром, набираючи подоби "пана". Доволі популярні в Україні бувальщини та оповідки про так звані "чортівські гулянки": "пани" запрошують музиканта пограти на весіллі, а на ранок той виявляє, що він на купині, а цілу ніч гостився коров’яками. 
        
        Зазвичай чорт перевтілюється на овечку чи барана, рідше — на кота, собаку, зайця, вужа. Якщо взяти таку "овечку" на воза, коні не рушать з місця, доки хтось не здогадається утворити хреста з соломинок  чи бодай перехреститися. Упродовж року оселю оберігали від "нечистої сили" проставлені на Водохреще й на Чистий четвер хрести. Найбільше ж чорти бояться блискавиці, якою пророк Ілля за наказом Господа їх нищить. 
        
        Хоча на теренах України також побутують уявлення про чорта як злого демона, який прагне звести людину зі світу й забрати її душу, у більшості оповідок він постає як демон-невдаха. Нерідко чорт стає жертвою анекдотичних ситуацій. Зокрема в Україні популярні сюжети, як жінка дурить чорта чи як чоловік обпік чорта смаженим салом. Донині, наприклад, старші люди забороняють свистіти, "щоб не кликати чорта", чи "колисати" ногами, "бо це чорта колишеш".</p>`,
    },
    {
        name: "Блазень",
        img: "../assets/images/blazen.jpg",
        text: `<p>В українській фольклористиці "блазень" - це одне з імен, що використовується для позначення демонічного або надприродного істоти. Зазвичай він зображується як химерна тварина з людськими або тваринними рисами, такими як хвіст, роги або крила. Він відомий своїм безглуздим поведінкою, пустотливими діями і нездатністю до розумової або моральної діяльності.

       <br> Цей персонаж зустрічається в українських народних казках та легендах як жартівливий або навіть тривіальний персонаж, який може викликати сміх або захоплення. У своїх діях він часто допомагає головному герою або виконує роль казкового помічника.</p>`,
    },
    {
        name: "Русалка",
        img: "../assets/images/rusalka.png",
        text: `<p>Русалки - це персонажі з народної демонології, які набувають вигляду привабливих дівчат з довгим розпущеним волоссям, прикрашеним квітами та зіллям. Вони представляють собою передчасно померлих дівчат, що знаходяться в зв'язку з водою. Водяні, польові та лісові русалки мають зовнішні відмінності та символізують сили природи. Вони можуть передбачати майбутнє, посіяти зелені пагінці і мати несподівану небезпеку, якщо заманити недбалого мандрівника у воду та залоскотати його.<br>
        Русалки зображуються як красиві молоді жінки з довгими волоссям, яке пливе водою. Часто вони мають риб'ячий хвіст замість ніг. Русалки відомі своєю здатністю співати прекрасно, і їхня мелодійна пісня може спокусити людей, приманюючи їх у воду. Вони також володіють здатністю змінювати свою зовнішність, перетворюючись на рибу або птаха.

У слов'янській міфології русалки мають подвійну природу. З одного боку, вони можуть бути добрими і допоміжними духами, які допомагають людям, рятувати від потоплення та виконувати інші благородні дії. З іншого боку, вони можуть бути підступними і небезпечними і здатними завести людей на заблудливі шляхи або навіть утопити їх.

Часто русалки пов'язують з обрядами, пов'язаними з водою, такими як купання в річках або озерах. В деяких традиціях їх зображують як нимф, що охороняють водні багатства та природу. Вони також можуть бути асоційовані зі смертю та загадковими обрядами, пов'язаними з водою.

Русалки є важливими персонажами у фольклорі, літературі, мистецтві та кіно країн слов'янської культури. Вони втіленням та символом прекрасного, загадкового та небезпечного світу води.</p>`,
    },
    {
        name: "Самодіви",
        img: "../assets/images/samodiva.jpg",
        text: `<p>Самодіви або віли, що належать до міфології південних слов'ян, є лісовими німфами, які є сестрами гірських німф, відомих як Самовіли. У народному уявленні самодіви зображаються як чарівні створіння з русими волоссям та чорними очима, які проживають у річках, озерах, джерелах, лісах, полях та долинах протягом весни і доосені. Вони віддають перевагу нічним громадським заходам, які включають танці, пісні та хороводи. Випадковому мандрівнику краще уникати таких місць, оскільки він може втратити орієнтацію або навіть загинути. Тільки збирачі лікувальних трав та вівчарі є неуразливими до злих чар, оскільки самодіви піддаються звукам мідних рогів. У кінці громадських заходів самодіви люблять купатися, супроводжуючи це шумом, криками та сміхом. Вода в річках і озерцях помітно збільшується під час цих купань, а джерела б'ють фонтанами на висоту людини. Самодіви ніколи не старіють.</p>`,
    },
    {
        name: "Домовик",
        img: "../assets/images/domovyk.jpg",
        text: `<p>Домовик — персонаж слов'янської міфології, дух або хатнє божество, що живе в хаті та піклується про неї та її жителів, або навпаки — шкодить їм.
        За основним місцем проживання — домом, домовик має назви: похатник, хатник, домашній дід, домовий, пожилець. Також відомий як служка, гуркало, доброхот, перейма, велесич.
        Унаслідок ототожнення домовика з нечистою силою, зокрема чортом і неупокоєним мерцем, він також має назви: лихий, ліхáч, нилапóй, дідько, чорт, чортик, сатана, враг, злий, злий дух, нидобрий, погань, нячисьцік, лякайло, пужало, начнік, нєдобра душа, мєртвєц, сьмєрть, «той, шчо памьор», знахор, коўдуннік. Зрідка — панок, панич, федик, антипко, хóванець чи виховáнець.
        Як правило домовик уявлявся невидимим, або видимим лише господарям хати чи тим людям, що добре до нього ставляться. Відомі вірування, що його здатні побачити праведні та безгрішні люди, зокрема діти, та свійські тварини. Його справжнім виглядом описувалась невелика тінь, схожа на силует людини, іноді з очима, що світяться. Часом домовик схожий на господаря, може поставати в подобі чоловічка або дідка. Також — як сірий чи білий кіт, собака, теля, зрідка — птах, вуж. Відомі перекази про домовика як дещо безформне й волохате, або що він здатний з'явитись в будь-якій подобі. Найчастіше він діє вночі та ввечері, хоча може проявити свою присутність у будь-який час. Особливим днями є Страсний четвер і Щедрий вечір, саме тоді домовика можна побачити найчастіше. Зазвичай домовика локалізують на горищі, коло покутнього вікна, в печі, в запічку, під піччю, у комині чи біля нього.

        У більшості випадків присутність домовика в хаті сприймалася як позитивна. Домовику приписувалося оберігання житла від лих, сприяння здоров'ю та розмноженню худоби, виконання за хазяїна роботи, відлякування злодіїв. Він міг дати певний знак, якщо мала статися важлива звістка чи прибути гість. Вважалося, домовик буде спокійний і доброзичливий, якщо родина живе у злагоді, лишає для нього частування. Домовик також начебто любить, коли в хаті прибрано, коли в ній не лаються. Разом з тим відомі уявлення, що домовик живе тільки в тих, хто не вірить в Бога, що за свою допомогу забирає життя. Крім того, за переказами, він оселяється лише в старих хатах, а в новобудовах не буває. Коли розгнівати домовика, він надокучатиме стукотом, розкидатиме речі або ховатиме їх, душитиме жителів і гостей хати, ганятиме коней. Домовик не любить, коли голіруч витирають стіл або лишають на ньому ножа, часник чи відкриту сіль, коли хтось хропе, коли в господарство купують худобу іншої масті. Згідно частини переказів, існують добрі та злі домовики і їхня поведінка не залежить від людини. Буває, що домовик незлюбить людину.

        Домовик зазвичай ототожнюється з померлим предком, який приходить до хати, щойно буде закладено її підмурівок, зведено піч, комин, або після завершення будівництва. Разом з тим існують народні пояснення, що домовик — це чорт, який живе в людській оселі, або що він — душа померлого на місці будівництва чи померлого в хаті. Часом проводиться розрізнення: чорт і дідько — це нечиста сила, що живе в людських оселях та біля них, тоді як біс — у лісах. В Карпатах і на суміжних територіях відомі вірування в годаванця — «хатнього чорта», що піклується про дім і родину, але після смерті забирає за це душу хазяїна. Смерть при цьому, як і в чаклунів та відьом, довга та болісна. Коли хазяїн помирає, то мусить передати домовика іншій людині, інакше той на свій розсуд перейде до його нащадків або наступних жителів хати. Є легенди, що багаті люди самі добувають собі домовиків: беруть малесеньке куряче яйце, кладуть собі під пахву і носять 9 днів; на десятий з нього вилуплюється домовик, який служить своєму господареві.

        Якщо виникала потреба захиститися від негативних чи ворожих дій домовика, висвячували хату, творили молитву, використовували різні церковні атрибути. Освячені предмети використовували під час входин у нову хату. Характерним було й обсипання хати освяченим маком, подекуди практикували обкурювання оселі чортополохом чи яким-небудь ядучим димом. щоб відвадити домовика від худоби, над дверима стайні наліплювали хрестик зі смоли. Дієвим способом захисту вважали переставляння хати на інше місце. Практикувалося й «відкуплення» від домовика розкиданням монет, лишанням для нього ласощів.</p>`,
    },
    {
        name: "Босоркун",
        img: "../assets/images/bosorkun.png",
        text: `<p>Босоркун - вітряний дух посух і хвороб (пошесті) або упир, який в українській міфології відомий своєю здатністю піднімати сильний вітер і літати з ним невидимим. Цей міфологічний персонаж шкодить людям і тваринам, викликаючи посуху та насилаючи хвороби і нездужання. Хто його затримує, того він вбиває силою вітру.
        <br><br>
        Босоркун найбільше активний уночі, особливо під час сонцевороту.
        Частенько після його нальотів молоко у корови виявляється змішаним з кров’ю або зовсім зникає. Особливо шкодять босоркуни людям вночі на Івана Купала (23 червня/7 липня), в день Луки (13/26 грудня) і святого Георгія, покровителя худоби (23 квітня/6 травня).</p>`,
    },
    {
        name: "Польовик",
        img: "../assets/images/Polovyk.png",
        text: `<p>Польовик — дух-хранитель полів, чоловік Полудниці.
        Польовик (Житній Дід, Гречуха) — дух, який охороняє хлібні поля. Його улюблений час — полудень. Живе він в полі тільки навесні і літом, під час сходу, росту і дозрівання хлібів.
        Ублажаючи Польовика, глухими ночами, в стороні від проїжджих доріг, приносять йому декілька яєць, а то і старого, безголосого півня.
        <br><br>
        В останньому снопі — останній притулок Польовика. Тому і особлива шана цьому снопу — його наряджають і залишають в полі до майбутньої весни.
        У деяких землях наряджений сніп несуть з піснями в село або переносять в житницю, де зберігають до нової сівби, щоб, засіявши витрушені з нього зерна, дати можливість відродитися Польовику в нових сходах.
        За народними віруваннями, польовик може постати у вигляді людини, птаха, бугая, козеняти тощо. Якщо уявлявся в людській подобі, то або в білому одязі, або голим, іноді з тваринними ознаками — мав шерсть, хвіст, кігті, крила, ріжки, телячі вуха і великі зуби. Також відомий образ польовика як діда з травою замість волосся, або ж він має очі різного кольору чи чорну, як земля, шкіру. Місцями його проживання вважалися поля, степи, луки, а особливо яри, рови. Йому приписувалася здатність змінювати зріст — коли колосся високе, високий і польовик, а коли його зжато — стає зростом зі стерню. Взимку польовик, як і лісовик, спить. У народному християнстві польовик — це чорт, що був скинутий Богом з неба під час бунту Сатани, і впав у полі.

        Польовик збиває зі шляху, заводить у небезпечні місця, але прихильний до тих, хто лишає для нього частування. Вважалося, жертва польовику мусить бути таємною, інакше він розгнівається і винищить врожай. Прихильному польовику приписувалася різноманітна допомога, він виводить заблукалих у колоссі дітей і худобу, вберігає поле від граду, а в час жнив відводить дощ.</p>`,
    },
    {
        name: "Лісовий Гриць",
        img: "../assets/images/lisovygryts.jpg",
        text: `<p>Лісовий Гриць є персонажем української народної міфології. Він володіє вигадливим характером та зображується як хитрий та дотепний чоловік з великими вухами та козячими ногами. Лісовий Гриць часто асоціюється з лісом та його духовним світом.

        Лісовий Гриць відомий своєю здатністю допомагати людям, які потрапили у скрутне положення або заблукали в лісі. Він може виконувати завдання, які люди просили його виконати, але зазвичай робить це за своїми власними правилами та з використанням своєї хитрощі. Він може надавати поради, але часто формулює їх у формі загадок або гумористичних приказок, що вимагають розумових зусиль, щоб їх зрозуміти.
        
        Лісовий Гриць також виступає як стражник лісу та його правил. Він може покарати тих, хто порушує природну рівновагу або необачно вносить зміни в лісове середовище. Люди повинні бути обережними та поважати ліс та його мешканців, щоб уникнути гніву Лісового Гриця.
        
        Українські народні казки та легенди часто розповідають про пригоди з участю Лісового Гриця. Він може бути головним героєм або виступати в якості перешкоди для головного героя, випробовуючи його розум, сміливість та винахідливість.
        
        Лісовий Гриць є важливою частиною української фольклорної традиції, символізуючи зв'язок між людьми та природою, а також вміння вирішувати проблеми за допомогою хитрощів та розуму. Він нагадує нам про важливість поваги до природи та балансу між людськими потребами та збереженням довкілля.</p>`,
    },
    {
        name: "Нічниця",
        img: "../assets/images/nichnytsa.jpg",
        text: `<p>Нічниці - це злий дух, який зазвичай має вигляд птахів, кажанів або хробаків. Часом вони можуть набувати образу жінок з довгим чорним волоссям. Якщо нічниці потрапляють до будинку, вони завдають мешканцям безсоння та жахіть. Особливо вони вразливі для дітей. Коли немовля не може заснути вночі і плаче, кажуть, що його обсіли нічниці. Також вони руйнують гнізда птахів, випивають їх яйця та душать пташенят.<br>
        Нічницями називалися ненароджені діти або ті, хто вчинив жахливий вчинок, вбивши свою матір.<br>

Внаслідок страху перед нічницями, матері після заходу сонця утримувалися від залишення пелюшок надворі, виходу з будинку та виношення дитини. Вони не залишали колиску відкритою і застосовували різноманітні обереги. Крім того, вони уникали купання дітей у воді, яка протягом ночі перебувала надворі.<br><br>
</p>`,
    },
    {
        name: "Дворовик",
        img: "../assets/images/dvorovyk.jpg",
        text: `<p>"Дворовик" - це привид або добрий дух, який вважається покровителем двору та помічником Домовика. Він має на меті охороняти всю тваринність і майно на подвір'ї від хвороб, пожеж, грабежу і сприяти процвітанню, достатку та щастю власника будинку.<br>
        Дворовики зображаються як маленькі старенькі чоловічки або бабуськи з характерними ознаками: високими капелюхами, довгими бородами та зеленими одягами. Вони надаються в жертву різноманітними обрядами та привітаннями для залучення їх благословення та захисту.
</p>`,
    },
];
// ! Обробник події для кнопки закриття в оверлея
document.querySelector(".closeBtn").addEventListener("click", () => {
    // Застосовує анімацію закриття overlay
    gsap.to(".overlay", {
        opacity: "0",
        x: "-100vw", // Зміщення вліво на розмір вікна перегляду
        duration: 0.3,
    });
    // Встановлює затримку перед прихованням overlay
    setTimeout(
        () => (document.querySelector(".overlay").style.display = "none"),
        1000
    );
});

// Відкроиття оверлею для кожного елемента з класом ".item" і заповнення данними його
document.querySelectorAll(".item").forEach((el) => {
    el.addEventListener("click", (e) => {
        let item = e.target.parentElement; // виправлення помилки повернення дочірнього елементу
        if (e.target.classList.contains("item")) item = e.target;
        let name = item.querySelector("h2").innerHTML; // Змінюємо заголовок в оверлеї на той який написаний в плитці
        let info = data.find((i) => i.name == name); // Шукаємо інформацію в масиві всіх створін по їх імені
        if (info) { // якщо не знаходить інформацію не опрацбовуємо
            // стилізуємо і запоінюємо інформацією
            document.querySelector(".overlay").style.display = "flex";
            document.querySelector(".overlay .name").innerHTML = info.name;
            document.querySelector(".overlay .overImg").src = info.img;
            document.querySelector(".overlay .text").innerHTML = info.text;
            // починаємо анімацію
            gsap.from(".overlay", {
                opacity: "0",
                x: "-100vw",
            });

            // кінець анімації
            gsap.to(".overlay", {
                opacity: "1",
                x: "0",
                duration: 0.5,
            });
        }
    });
});

let openOverlay = (name) => {
    let info = data.find((i) => i.name == name);
    if (info) {
        document.querySelector(".overlay").style.display = "flex";
        document.querySelector(".overlay .name").innerHTML = info.name;
        document.querySelector(".overlay .overImg").src = info.img;
        document.querySelector(".overlay .text").innerHTML = info.text;
        gsap.from(".overlay", {
            opacity: "0",
            x: "-100vw",
        });
        gsap.to(".overlay", {
            opacity: "1",
            x: "0",
            duration: 0.5,
        });
    }
};
