let data = [
    {
        name: "Лісовик",
        img: "../assets/images/photo_2023-12-26_14-42-00.jpg",
        text: `<p>   Лісовик (також відомий як лісний дух, лісовий дух або лісний гоблін) - це істота з фольклору та міфології, пов'язана з лісом. Цей персонаж має різні вигляди в різних культурах і легендах.
        </p>
        <br>
        <p>    У деяких варіантах, лісовик може бути зображений як маленька істота з людською або подібною до людини формою. Він може мати зелену або коричневу шкіру, волосся чи бороду з листям або мохом, що допомагає йому злитися з лісовим середовищем. Його очі можуть бути яскраві та загадкові, а вуха - великі і сплющені, схожі на вуха тварини.

     Він може носити одяг у вигляді листя, кори, гілок або натуральних матеріалів, що допомагає йому приховатися серед дерев та рослин. Він часто володіє волшебними здібностями, пов'язаними з природою, і вважається покровителем лісу та його мешканців.
         </p>
        `,
    },
    {
        name: "Вовкулака",
        img: "../assets/images/photo_2023-12-26_15-19-07.jpg",
        text: `<p> Вовкулака - це міфічне створіння, яке зустрічається в українському фольклорі. Вовкулака також відома як "вовчий чоловік" або "оборотень". Згідно з українськими легендами, вовкулака має здатність перетворюватися на вовка або оборотня.

        Опис вовкулаки в українському фольклорі може варіюватися. Іноді вовкулаку зображають як великого, жахливого вовка з людськими рисами, здатним говорити. Інші версії описують вовкулаку як оборотня, який здатний перетворюватися на вовка чи людину.
        
        Українські легенди пов'язують вовкулаку з різними негативними атрибутами, такими як хижість, кровожадність та зв'язок зі смертю. Віриться, що вовкулаки полюють на людей та худобу, а їх смертоносні здібності проявляються особливо сильно під час повного місяця.
        З'являються такі істоти в тому випадку якщо вагітна жінка неочікувано бачить вовка або з'їдає його жертву. оли він з'являється у своїй людській формі, має зловісний вигляд з великими бровами, що зростають на переніссі, та червоними очима, що служать його впізнавальною рисою.</p><br>

        
        <p>Важливо зазначити, що вовкулака - це істота з української міфології та фольклору, і не існують докази його реального існування. Вовкулака є популярним персонажем української культури, який часто зустрічається в українських казках, легендах та народних оповіданнях.</p> `,
    },
    {
        name: "Чугайстер",
        img: "../assets/images/photo_2023-12-26_16-24-53.jpg",
        text: `<p> Пов'язані з Чугайстером існують різні історії та легенди. Ось кілька прикладів:
<br><br>
        1. За однією з версій, Чугайстер колись був звичайним чоловіком, який випадково потрапив під прокляття злих відьом. Прокляття перетворило його на страхітливу істоту, змушуючи блукати лісом у пошуках жертв. Люди, які зустрічають Чугайстера, повинні уникати його, або ж виявити доброту і милосердя, щоб змінити його прокляття.
        <br>     
        2. Існує також версія, що Чугайстер є оборотнем або перевертнем, здатним змінювати свою форму або вигляд. Він може приймати різні образи, щоб збентежити та заплутати тих, хто потрапляє в його лісовий уклад.
        <br>  
        3. За деякими легендами, Чугайстер володіє магічними здібностями та знаннями про таємниці лісу. Він може бути порадником і помічником тим, хто проявляє повагу до природи і має добрі наміри. В таких історіях Чугайстер може виконувати добрі вчинки і допомагати людям, які потрапляють у складні ситуації.
        <br>
        Це лише кілька варіантів історій, пов'язаних з Чугайстером. В різних регіонах та культурах можуть існувати різні інтерпретації цього персонажа.</p><br>

        
        <p> </p>`,
    },
    {
        name: "Вовкулака",
        img: "../assets/images/photo_2023-12-26_15-19-07.jpg",
        text: `<p> Вовкулака - це міфічне створіння, яке зустрічається в українському фольклорі. Вовкулака також відома як "вовчий чоловік" або "оборотень". Згідно з українськими легендами, вовкулака має здатність перетворюватися на вовка або оборотня.

        Опис вовкулаки в українському фольклорі може варіюватися. Іноді вовкулаку зображають як великого, жахливого вовка з людськими рисами, здатним говорити. Інші версії описують вовкулаку як оборотня, який здатний перетворюватися на вовка чи людину.
        
        Українські легенди пов'язують вовкулаку з різними негативними атрибутами, такими як хижість, кровожадність та зв'язок зі смертю. Віриться, що вовкулаки полюють на людей та худобу, а їх смертоносні здібності проявляються особливо сильно під час повного місяця.
        З'являються такі істоти в тому випадку якщо вагітна жінка неочікувано бачить вовка або з'їдає його жертву. оли він з'являється у своїй людській формі, має зловісний вигляд з великими бровами, що зростають на переніссі, та червоними очима, що служать його впізнавальною рисою.</p><br>

        
        <p>Важливо зазначити, що вовкулака - це істота з української міфології та фольклору, і не існують докази його реального існування. Вовкулака є популярним персонажем української культури, який часто зустрічається в українських казках, легендах та народних оповіданнях.</p> `,
    },
    {
        name: "Стратим-птиця",
        img: "../assets/images/image_2023-12-26_17-12-58.png",
        text: `<p> Алконост — дивовижна птиця, мешканка Вирію — слов’янського раю.
        </p>`,
    },
    {
        name: "Алконост",
        img: "../assets/images/image_2023-12-26_17-20-58.png",
        text: `<p> </p>`,
    },
];

document.querySelector(".closeBtn").addEventListener("click", () => {
    gsap.to(".overlay", {
        opacity: "0",
        x: "-100vw",
        duration: 0.3,
    });
    setTimeout(
        () => (document.querySelector(".overlay").style.display = "none"),
        1000
    );
});

document.querySelectorAll(".item").forEach((el) => {
    el.addEventListener("click", (e) => {
        let item = e.target.parentElement;
        if (e.target.classList.contains("item")) item = e.target;
        let name = item.querySelector("h2").innerHTML;
        let info = data.find((i) => i.name == name);
        if (info) {
            document.querySelector(".overlay").style.display = "flex";
            document.querySelector(".overlay .name").innerHTML = info.name;
            document.querySelector(".overlay .overImg").src = info.img;
            document.querySelector(".overlay .text").innerHTML = info.text;
            gsap.from(".overlay", {
                opacity: "0",
                x: "-100vw",
            });
            gsap.to(".overlay", {
                opacity: "1",
                x: "0",
                duration: 0.5,
            });
        }
    });
});

let openOverlay = (name) => {
    let info = data.find((i) => i.name == name);
    if (info) {
        document.querySelector(".overlay").style.display = "flex";
        document.querySelector(".overlay .name").innerHTML = info.name;
        document.querySelector(".overlay .overImg").src = info.img;
        document.querySelector(".overlay .text").innerHTML = info.text;
        gsap.from(".overlay", {
            opacity: "0",
            x: "-100vw",
        });
        gsap.to(".overlay", {
            opacity: "1",
            x: "0",
            duration: 0.5,
        });
    }
};
