let data = [
    {
        name: "Лісовик",
        img: "../assets/images/photo_2023-12-26_14-42-00.jpg",
        text: `<p>   Лісовик (також відомий як лісний дух, лісовий дух або лісний гоблін) - це істота з фольклору та міфології, пов'язана з лісом. Цей персонаж має різні вигляди в різних культурах і легендах.
        </p>
        <br>
        <p>    У деяких варіантах, лісовик може бути зображений як маленька істота з людською або подібною до людини формою. Він може мати зелену або коричневу шкіру, волосся чи бороду з листям або мохом, що допомагає йому злитися з лісовим середовищем. Його очі можуть бути яскраві та загадкові, а вуха - великі і сплющені, схожі на вуха тварини.

        Він може носити одяг у вигляді листя, кори, гілок або натуральних матеріалів, що допомагає йому приховатися серед дерев та рослин. Він часто володіє волшебними здібностями, пов'язаними з природою, і вважається покровителем лісу та його мешканців.
         </p>
        `,
    },
    {
        name: "Вовкулака",
        img: "../assets/images/photo_2023-12-26_15-19-07.jpg",
        text: `<p> Вовкулака - це міфічне створіння, яке зустрічається в українському фольклорі. Вовкулака також відома як "вовчий чоловік" або "оборотень". Згідно з українськими легендами, вовкулака має здатність перетворюватися на вовка або оборотня.

        Опис вовкулаки в українському фольклорі може варіюватися. Іноді вовкулаку зображають як великого, жахливого вовка з людськими рисами, здатним говорити. Інші версії описують вовкулаку як оборотня, який здатний перетворюватися на вовка чи людину.
        
        Українські легенди пов'язують вовкулаку з різними негативними атрибутами, такими як хижість, кровожадність та зв'язок зі смертю. Віриться, що вовкулаки полюють на людей та худобу, а їх смертоносні здібності проявляються особливо сильно під час повного місяця.
        З'являються такі істоти в тому випадку якщо вагітна жінка неочікувано бачить вовка або з'їдає його жертву. оли він з'являється у своїй людській формі, має зловісний вигляд з великими бровами, що зростають на переніссі, та червоними очима, що служать його впізнавальною рисою.</p><br>

        
        <p>Важливо зазначити, що вовкулака - це істота з української міфології та фольклору, і не існують докази його реального існування. Вовкулака є популярним персонажем української культури, який часто зустрічається в українських казках, легендах та народних оповіданнях.</p> `,
    },
    {
        name: "Чугайстер",
        img: "../assets/images/photo_2023-12-26_16-24-53.jpg",
        text: `<p> Пов'язані з Чугайстером існують різні історії та легенди. Ось кілька прикладів:
        <br><br>
        1. За однією з версій, Чугайстер колись був звичайним чоловіком, який випадково потрапив під прокляття злих відьом. Прокляття перетворило його на страхітливу істоту, змушуючи блукати лісом у пошуках жертв. Люди, які зустрічають Чугайстера, повинні уникати його, або ж виявити доброту і милосердя, щоб змінити його прокляття.
        <br>     
        2. Існує також версія, що Чугайстер є оборотнем або перевертнем, здатним змінювати свою форму або вигляд. Він може приймати різні образи, щоб збентежити та заплутати тих, хто потрапляє в його лісовий уклад.
        <br>  
        3. За деякими легендами, Чугайстер володіє магічними здібностями та знаннями про таємниці лісу. Він може бути порадником і помічником тим, хто проявляє повагу до природи і має добрі наміри. В таких історіях Чугайстер може виконувати добрі вчинки і допомагати людям, які потрапляють у складні ситуації.
        <br>
        Це лише кілька варіантів історій, пов'язаних з Чугайстером. В різних регіонах та культурах можуть існувати різні інтерпретації цього персонажа.</p><br>

        
        <p> </p>`,
    },
    {
        name: "Мавка",
        img: "../assets/images/mavkaLisova.jpg",
        text: `<p>Мавка - це персонаж української фольклорної традиції, який часто зустрічається в українських казках, легендах та народних піснях. Мавка зазвичай зображується як молода дівчина з довгими волоссям та вбрана у весняні квіткові сукні.

        У фольклорі Мавка часто асоціюється з лісом та природою. Вона вважається покровителькою лісу, рослин, тварин і всього живого. Мавка володіє магічними здібностями та може змінювати свій зовнішній вигляд, зникаючи серед дерев або перетворюючись на тварину.
        
        У казках Мавка часто зустрічається як загадкова та приваблива дівчина, яка привертає увагу чоловіків. Вона може допомагати або завдає шкоди людям, залежно від їхньої поведінки та ставлення до природи. Мавка також відома своєю здатністю заворожувати своїм співом та танцями.
        
        <br>Мавка є символом природи, її краси та сили, а також нагадує людям про важливість бережного ставлення до навколишнього середовища. <br> <br>
        Мавка пов'язана зі сезонами та циклічністю життя. Вона виступає як захисниця дикої природи та її ресурсів. Часто її зображують у зв'язку з рослинністю, водними джерелами та тваринами лісу.

        У фольклорних оповіданнях Мавка може мати різні риси характеру. Вона може бути доброю та милосердною до людей, але також може виявляти свою сильну та непередбачувану сторону. Легенди про Мавку часто пов'язані з магією, коханням та світовим порядком.

        Мавка стала невід'ємною частиною української культури, мистецтва та літератури. Вона з'являється у багатьох відомих творах, таких як поема Лесі Українки "Мавка", опери Миколи Лисенка "Тарас Бульба" та багатьох інших. Образ Мавки надихав художників, письменників та поетів протягом багатьох століть і продовжує жити в українській культурі.

        <br><br> Мавка не залишає тіні, а коли вона біжить, трава не перегинається. Одна зі страшних рис мавок в деяких джерелах полягає у тому, що ззаду видно, що вони не мають спини й прозираються їхні нутрощі. Вони часто допомагають людям у догляді за худобою, захищаючи її від звірів, вони також вміють засівати рослини.</p> `,
    },
    {
        name: "Стратим-птиця",
        img: "../assets/images/image_2023-12-26_17-12-58.png",
        text: `<p> Стратим-птиця — усім птицям мати. Живе Стратим-птиця на океані-морі. І дітей робить на океані-морі.
        <br><br>
         Тримає увесь білий світ під правим крилом. Топить вона кораблі з товарами дорогоцінними. Коли Стратим стрепенеться о другій годині після півночі, заспівують усі півні та на усій землі. Тому Стратим-птиця усім птахам мати.
        Мабуть, про цього ж велетенського птаха, якого іноді називали Страфілом, оповідає давній рукопис: «Єсть курей, що головою досягає до небес, а море йому до коліна; коли сонце омивається в океані, тоді океан всколєбається, і почнуть хвилі бити кура по пір’ю; він же, відчувши хвилі, кричить “коко-реку”, що означає: “Господи, Явь світу світло!”».
        Втім, вчені вважають, що Стратим не надпівень, а страус: колись дуже давно перекладачі зіткнулися з цим словом в грецькому тексті і, не знаючи такого птаха, просто переписали найменування слов’янськими буквами. Ось і вийшло «Стратим». Зображували птаха-гіганта з маленькою головою на тонкій шийці, гачкуватим дзьобом, довгим вузьким тілом і одним піднятим вгору крилом. 
        Стратим — була світлим птахом бога вітрів, Стрибога, вона управляє усіма вітрами.</p>`,
    },
    {
        name: "Алконост",
        img: "../assets/images/alkonost.jpg",
        text: `<p>Алконост — дивовижна птиця, мешканка Вирію — слов’янського раю.
        <br><br>
        Лице у неї жіноче, голова увінчана короною й "ореолом, на якому іноді поміщено короткий напис", тіло ж пташине.
        В руках тримає райські квіти або розгорнутий сувій з пояснювальним написом.
        У деяких описах згадується "річка Евфраній" як місце проживання. Голос в Алконоста солодкий, як сама любов. Хто почує спів Алконоста, від захвату може забути усе на світі, але зла від неї немає, на відміну від Сиріна. Алконост несе яйця «на краю моря», але не висиджує їх, а занурює в морську глибину. У цю пору сім днів стоїть безвітряна погода.Має дівочу голову, . </p>`,
    },
    {
        name: "Болотник та Болотниця",
        img: "../assets/images/",
        text: `<p>Болотник (Болотник, Болотняник, Багник) — злий дух на болоті, який намагається затягнути людину в трясовину; рід лісовика або водяного, який живе у болоті. У Новгородській Кормчій ХІІІ ст. відмічено, що язичники «жроуть (приносять жертви) бісом, і болотом, і колодязем». Дух болота, живе у великому кам’яному будинку з дружиною і дітьми. Дружина його — Болотниця, діва, яка потонула в болоті. Він родич водяного і лісовика. Болотняник — сивий старий з широким жовтуватим обличчям.
        Обернувшись ченцем, обходить і заводить подорожнього, заманює його в трясовину. Любить гуляти по берегу, лякати тих, хто йде через болото, різкими звуками, зітханнями; видуваючи повітря водяними пухирями, голосно прицмокує.
        Болотняник вправно влаштовує пастки для нетямущих: кине клапоть зеленої трави або корч, або колоду — так і вабить ступити, а під ним — трясовина, глибока драговина! Ну а ночами випускає він душі дітей, які потонули нехрещеними, і тоді на болоті перебігають-перемигуються блудні сині вогники.
        <br><br>
        Болотниця, також відома як омутниця або лопатниця, є персонажем української міфології. Вона є водяною пані, яка живе в болотах та трясовинах. Болотницю описують як дівчину з білою шкірою та чорним волоссям. У неї гусячі ноги з перетинками, а очі горять, як у кішки.

За повір'ями, болотниця з'являється в ясну літню ніч, коли піднімається з трясовини та сідає серед трав і квітів, ховаючи свої гусячі ноги. Вона кличе людину ніжним голосом та благає вивести її з болота. Але якщо людина підійде ближче, болотниця миттєво затягне її до себе у трясовину. Крім того, болотниця може насилати на поля нищівні бурі, зливи та град.

Варто зазначити, що образ болотниці не зафіксований у слов'янських фольклорних джерелах, тому немає підстав вважати її справжньою частиною народних вірувань. Проте, болотниця існує в казках інших народів, наприклад, в Данії </p>`,
    },
    {
        name: "Потерчата",
        img: "../assets/images/poterchata.jpg",
        text: `<p>Потерча (також відомий як потерчук або страдча) - це істота з української міфології, яка представляє собою дитину, що померла, не бувши хрещеною. Існування таких демонічних істот стало відомим після хрещення Русі. Важливо зауважити, що давня традиція надавати імена таким неспокійним душам, які турбують живих, має коріння у міфології про створення світу. Згідно з цим міфом, кожне створіння у всесвіті отримувало своє ім'я, і саме через це набувало існування. Таким чином, дати ім'я означало надати життя.

        Тепер давайте перейдемо до цікавих фактів про потерчат. Як вже згадувалося, вони є мертвими дітьми, часто тими, хто помер до семи років і не був хрещеним. Така дитина не могла піднятися до небес. Якщо протягом семи років після смерті такому немовляті ніхто не надасть імені (через обряд, що був описаний раніше), його душа потрапляє під владу нечистої сили. Однак, якщо "хрещення" відбудеться, дитина стає ангелом.
        
        Часто таких малюків крадуть русалки, і вони самі стають русалками-семилітками. Вони мають особливу здатність добре загадувати та розгадувати загадки.
        
        <br><br>Злі духи терзають викрадених немовлят, і лише під час Зелених свят вони вільні від страждань. Так, у Лубенському повіті на Полтавщині жінки, які поховали нехрещених малюків, колись збирали всіх дітей з вулиці на Русалчин Великдень (четвер під час Троїцького тижня) і пригощали їх. На Поділлі, під час архаїчного обряду «гоніння шуляка», жінки вшановували своїх померлих, зокрема нехрещених, дітей. За віруванням, під час Зелених свят вони з'являлися у вигляді "мавок", "нявок", "гречух" і лякали всіх своєю непередбачуваною поведінкою.</p>`,
    },
    {
        name: "Гамаюн",
        img: "../assets/images/gamayun.png",
        text: `<p>Гамаюн — віщий птах, посланець богів, їх глашатай, який співає людям божественні гімни і провіщає майбутнє тим, хто уміє чути таємне.

        У старовинній «Книзі, глаголемой Козмографія» на карті зображена кругла рівнина землі, омивана з усіх боків річкою-океаном. На східній стороні зазначений «острів Макарійський, перший під самим сходом сонця, біля блаженного раю; тому його так нарікають, що залітають в цей острів птахи райські Гамаюн і Фенікс і пахощі заносять дивні». Коли летить Гамаюн, зі сходу сонячного виходить смертоносна буря.
        
        Гамаюн усе на світі знає: про походження землі і неба, богів і героїв, людей і чудовиськ, птахів і звірів.

        Історія образу Гамаюна має свої корені в іранському фольклорі, де птах з назвою "хума(й)" вважався міфічною птахою щастя, яка приносила владу тим, над ким вона пролітає низько, повіваючи крилами над їхньою головою. Українське слово "Гамаюн" є іскаженням цього іранського слова.</p>`,
    },
    {
        name: "Сиріна",
        img: "../assets/images/serina.png",
        text: `<p></p>`,
    },
    {
        name: "Полудниця",
        img: "../assets/images/",
        text: `<p></p>`,
    },
    {
        name: "",
        img: "../assets/images/",
        text: `<p></p>`,
    },
    {
        name: "Самодіви",
        img: "../assets/images/samodiva.jpg",
        text: `<p>Самодіви або віли, що належать до міфології південних слов'ян, є лісовими німфами, які є сестрами гірських німф, відомих як Самовіли. У народному уявленні самодіви зображаються як чарівні створіння з русими волоссям та чорними очима, які проживають у річках, озерах, джерелах, лісах, полях та долинах протягом весни і доосені. Вони віддають перевагу нічним громадським заходам, які включають танці, пісні та хороводи. Випадковому мандрівнику краще уникати таких місць, оскільки він може втратити орієнтацію або навіть загинути. Тільки збирачі лікувальних трав та вівчарі є неуразливими до злих чар, оскільки самодіви піддаються звукам мідних рогів. У кінці громадських заходів самодіви люблять купатися, супроводжуючи це шумом, криками та сміхом. Вода в річках і озерцях помітно збільшується під час цих купань, а джерела б'ють фонтанами на висоту людини. Самодіви ніколи не старіють.</p>`,
    },
    {
        name: "Домовик",
        img: "../assets/images/domovyk.jpg",
        text: `<p>Домовик — персонаж слов'янської міфології, дух або хатнє божество, що живе в хаті та піклується про неї та її жителів, або навпаки — шкодить їм.
        За основним місцем проживання — домом, домовик має назви: похатник, хатник, домашній дід, домовий, пожилець. Також відомий як служка, гуркало, доброхот, перейма, велесич.
        Унаслідок ототожнення домовика з нечистою силою, зокрема чортом і неупокоєним мерцем, він також має назви: лихий, ліхáч, нилапóй, дідько, чорт, чортик, сатана, враг, злий, злий дух, нидобрий, погань, нячисьцік, лякайло, пужало, начнік, нєдобра душа, мєртвєц, сьмєрть, «той, шчо памьор», знахор, коўдуннік. Зрідка — панок, панич, федик, антипко, хóванець чи виховáнець.
        Як правило домовик уявлявся невидимим, або видимим лише господарям хати чи тим людям, що добре до нього ставляться. Відомі вірування, що його здатні побачити праведні та безгрішні люди, зокрема діти, та свійські тварини. Його справжнім виглядом описувалась невелика тінь, схожа на силует людини, іноді з очима, що світяться. Часом домовик схожий на господаря, може поставати в подобі чоловічка або дідка. Також — як сірий чи білий кіт, собака, теля, зрідка — птах, вуж. Відомі перекази про домовика як дещо безформне й волохате, або що він здатний з'явитись в будь-якій подобі. Найчастіше він діє вночі та ввечері, хоча може проявити свою присутність у будь-який час. Особливим днями є Страсний четвер і Щедрий вечір, саме тоді домовика можна побачити найчастіше. Зазвичай домовика локалізують на горищі, коло покутнього вікна, в печі, в запічку, під піччю, у комині чи біля нього.

        У більшості випадків присутність домовика в хаті сприймалася як позитивна. Домовику приписувалося оберігання житла від лих, сприяння здоров'ю та розмноженню худоби, виконання за хазяїна роботи, відлякування злодіїв. Він міг дати певний знак, якщо мала статися важлива звістка чи прибути гість. Вважалося, домовик буде спокійний і доброзичливий, якщо родина живе у злагоді, лишає для нього частування. Домовик також начебто любить, коли в хаті прибрано, коли в ній не лаються. Разом з тим відомі уявлення, що домовик живе тільки в тих, хто не вірить в Бога, що за свою допомогу забирає життя. Крім того, за переказами, він оселяється лише в старих хатах, а в новобудовах не буває. Коли розгнівати домовика, він надокучатиме стукотом, розкидатиме речі або ховатиме їх, душитиме жителів і гостей хати, ганятиме коней. Домовик не любить, коли голіруч витирають стіл або лишають на ньому ножа, часник чи відкриту сіль, коли хтось хропе, коли в господарство купують худобу іншої масті. Згідно частини переказів, існують добрі та злі домовики і їхня поведінка не залежить від людини. Буває, що домовик незлюбить людину.

        Домовик зазвичай ототожнюється з померлим предком, який приходить до хати, щойно буде закладено її підмурівок, зведено піч, комин, або після завершення будівництва. Разом з тим існують народні пояснення, що домовик — це чорт, який живе в людській оселі, або що він — душа померлого на місці будівництва чи померлого в хаті. Часом проводиться розрізнення: чорт і дідько — це нечиста сила, що живе в людських оселях та біля них, тоді як біс — у лісах. В Карпатах і на суміжних територіях відомі вірування в годаванця — «хатнього чорта», що піклується про дім і родину, але після смерті забирає за це душу хазяїна. Смерть при цьому, як і в чаклунів та відьом, довга та болісна. Коли хазяїн помирає, то мусить передати домовика іншій людині, інакше той на свій розсуд перейде до його нащадків або наступних жителів хати. Є легенди, що багаті люди самі добувають собі домовиків: беруть малесеньке куряче яйце, кладуть собі під пахву і носять 9 днів; на десятий з нього вилуплюється домовик, який служить своєму господареві.

        Якщо виникала потреба захиститися від негативних чи ворожих дій домовика, висвячували хату, творили молитву, використовували різні церковні атрибути. Освячені предмети використовували під час входин у нову хату. Характерним було й обсипання хати освяченим маком, подекуди практикували обкурювання оселі чортополохом чи яким-небудь ядучим димом. щоб відвадити домовика від худоби, над дверима стайні наліплювали хрестик зі смоли. Дієвим способом захисту вважали переставляння хати на інше місце. Практикувалося й «відкуплення» від домовика розкиданням монет, лишанням для нього ласощів.</p>`,
    },
    {
        name: "Босоркун",
        img: "../assets/images/bosorkun.png",
        text: `<p>Босоркун - вітряний дух посух і хвороб (пошесті) або упир, який в українській міфології відомий своєю здатністю піднімати сильний вітер і літати з ним невидимим. Цей міфологічний персонаж шкодить людям і тваринам, викликаючи посуху та насилаючи хвороби і нездужання. Хто його затримує, того він вбиває силою вітру.
        <br><br>
        Босоркун найбільше активний уночі, особливо під час сонцевороту.
        Частенько після його нальотів молоко у корови виявляється змішаним з кров’ю або зовсім зникає. Особливо шкодять босоркуни людям вночі на Івана Купала (23 червня/7 липня), в день Луки (13/26 грудня) і святого Георгія, покровителя худоби (23 квітня/6 травня).</p>`,
    },
    {
        name: "Польовик",
        img: "../assets/images/Polovyk.png",
        text: `<p>Польовик — дух-хранитель полів, чоловік Полудниці.
        Польовик (Житній Дід, Гречуха) — дух, який охороняє хлібні поля. Його улюблений час — полудень. Живе він в полі тільки навесні і літом, під час сходу, росту і дозрівання хлібів.
        Ублажаючи Польовика, глухими ночами, в стороні від проїжджих доріг, приносять йому декілька яєць, а то і старого, безголосого півня.
        <br><br>
        В останньому снопі — останній притулок Польовика. Тому і особлива шана цьому снопу — його наряджають і залишають в полі до майбутньої весни.
        У деяких землях наряджений сніп несуть з піснями в село або переносять в житницю, де зберігають до нової сівби, щоб, засіявши витрушені з нього зерна, дати можливість відродитися Польовику в нових сходах.
        За народними віруваннями, польовик може постати у вигляді людини, птаха, бугая, козеняти тощо. Якщо уявлявся в людській подобі, то або в білому одязі, або голим, іноді з тваринними ознаками — мав шерсть, хвіст, кігті, крила, ріжки, телячі вуха і великі зуби. Також відомий образ польовика як діда з травою замість волосся, або ж він має очі різного кольору чи чорну, як земля, шкіру. Місцями його проживання вважалися поля, степи, луки, а особливо яри, рови. Йому приписувалася здатність змінювати зріст — коли колосся високе, високий і польовик, а коли його зжато — стає зростом зі стерню. Взимку польовик, як і лісовик, спить. У народному християнстві польовик — це чорт, що був скинутий Богом з неба під час бунту Сатани, і впав у полі.

        Польовик збиває зі шляху, заводить у небезпечні місця, але прихильний до тих, хто лишає для нього частування. Вважалося, жертва польовику мусить бути таємною, інакше він розгнівається і винищить врожай. Прихильному польовику приписувалася різноманітна допомога, він виводить заблукалих у колоссі дітей і худобу, вберігає поле від граду, а в час жнив відводить дощ.</p>`,
    },
    {
        name: "Лісовий Гриць",
        img: "../assets/images/lisovygryts.jpg",
        text: `<p>Лісовий Гриць є персонажем української народної міфології. Він володіє вигадливим характером та зображується як хитрий та дотепний чоловік з великими вухами та козячими ногами. Лісовий Гриць часто асоціюється з лісом та його духовним світом.

        Лісовий Гриць відомий своєю здатністю допомагати людям, які потрапили у скрутне положення або заблукали в лісі. Він може виконувати завдання, які люди просили його виконати, але зазвичай робить це за своїми власними правилами та з використанням своєї хитрощі. Він може надавати поради, але часто формулює їх у формі загадок або гумористичних приказок, що вимагають розумових зусиль, щоб їх зрозуміти.
        
        Лісовий Гриць також виступає як стражник лісу та його правил. Він може покарати тих, хто порушує природну рівновагу або необачно вносить зміни в лісове середовище. Люди повинні бути обережними та поважати ліс та його мешканців, щоб уникнути гніву Лісового Гриця.
        
        Українські народні казки та легенди часто розповідають про пригоди з участю Лісового Гриця. Він може бути головним героєм або виступати в якості перешкоди для головного героя, випробовуючи його розум, сміливість та винахідливість.
        
        Лісовий Гриць є важливою частиною української фольклорної традиції, символізуючи зв'язок між людьми та природою, а також вміння вирішувати проблеми за допомогою хитрощів та розуму. Він нагадує нам про важливість поваги до природи та балансу між людськими потребами та збереженням довкілля.</p>`,
    },
];

document.querySelector(".closeBtn").addEventListener("click", () => {
    gsap.to(".overlay", {
        opacity: "0",
        x: "-100vw",
        duration: 0.3,
    });
    setTimeout(
        () => (document.querySelector(".overlay").style.display = "none"),
        1000
    );
});

document.querySelectorAll(".item").forEach((el) => {
    el.addEventListener("click", (e) => {
        let item = e.target.parentElement;
        if (e.target.classList.contains("item")) item = e.target;
        let name = item.querySelector("h2").innerHTML;
        let info = data.find((i) => i.name == name);
        if (info) {
            document.querySelector(".overlay").style.display = "flex";
            document.querySelector(".overlay .name").innerHTML = info.name;
            document.querySelector(".overlay .overImg").src = info.img;
            document.querySelector(".overlay .text").innerHTML = info.text;
            gsap.from(".overlay", {
                opacity: "0",
                x: "-100vw",
            });
            gsap.to(".overlay", {
                opacity: "1",
                x: "0",
                duration: 0.5,
            });
        }
    });
});

let openOverlay = (name) => {
    let info = data.find((i) => i.name == name);
    if (info) {
        document.querySelector(".overlay").style.display = "flex";
        document.querySelector(".overlay .name").innerHTML = info.name;
        document.querySelector(".overlay .overImg").src = info.img;
        document.querySelector(".overlay .text").innerHTML = info.text;
        gsap.from(".overlay", {
            opacity: "0",
            x: "-100vw",
        });
        gsap.to(".overlay", {
            opacity: "1",
            x: "0",
            duration: 0.5,
        });
    }
};
